app/views/users/view.html.erb

	<div class='col-md-3'>
		<% @user.microposts.each do |post| %>
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = $1  [["user_id", 3]]