app/controllers/admin_posts_controller.rb

	def index
		@posts = Micropost.order(:id).reverse_order
---
SELECT "microposts".* FROM "microposts" ORDER BY "microposts"."id" DESC

	def create
        if params[:micropost].key?(:cover)
  		    uploaded_io = params[:micropost][:cover]
		    File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
		      file.write(uploaded_io.read)
		    end
		    cover = '/uploads/' + uploaded_io.original_filename
        else
            cover = '/img/default_post.jpg'
        end
		@post = Micropost.new(post_params)
		@post.user = @current_user
		@post.cover = cover
        if @post.save
---
INSERT INTO "microposts" ("content", "name", "cover", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "new"], ["name", "new"], ["cover", "/img/default_post.jpg"], ["created_at", "2019-05-26 19:51:25.559608"], ["updated_at", "2019-05-26 19:51:25.559608"], ["user_id", 6]]

	def destroy
		Micropost.find(params[:id]).destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = $1  [["id", 1]]
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def edit
		@post = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def save
		if params[:micropost].key?(:cover)
			uploaded_io = params[:micropost][:cover]
			File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
				file.write(uploaded_io.read)
			end
			cover = '/uploads/' + uploaded_io.original_filename
		end
		@post = Micropost.update(params[:id], post_params)
		Micropost.update(params[:id], cover: cover) if cover
---
UPDATE "microposts" SET "name" = $1, "content" = $2, "updated_at" = $3 WHERE "microposts"."id" = $4
UPDATE "microposts" SET "cover" = $1, "updated_at" = $2 WHERE "microposts"."id" = $3  [["cover", "/uploads/news_3.jpg"], ["updated_at", "2019-05-30 18:42:31.047871"], ["id", 6]]