app/controllers/admin_teachers_controller.rb

	def create
		if params[:teacher].key?(:photo)
			uploaded_io = params[:teacher][:photo]
			File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
				file.write(uploaded_io.read)
			end
			photo = '/uploads/' + uploaded_io.original_filename
		else
			photo = '/img/default_teacher.jpg'
		end
		@teacher = Teacher.new(teacher_params)
		@teacher.photo = photo
		if @teacher.save
---
INSERT INTO "teachers" ("name", "subject", "photo", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def destroy
		Teacher.find(params[:id]).destroy
---
DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 1]]
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

	def edit
		@teacher = Teacher.find(params[:id])
---
SELECT  "teachers".* FROM "teachers" WHERE "teachers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

	def save
		if params[:teacher].key?(:photo)
			uploaded_io = params[:teacher][:photo]
			File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
				file.write(uploaded_io.read)
			end
			photo = '/uploads/' + uploaded_io.original_filename
		end
		@teacher = Teacher.update(params[:id], teacher_params)
		Teacher.update(params[:id], photo: photo) if photo
---
UPDATE "teachers" SET "name" = $1, "subject" = $2, "description" = $3, "updated_at" = $4 WHERE "teachers"."id" = $5  [["name", "Шинкаренко Ирина Миайловна"], ["subject", "История"], ["description", "учитель 1 категории"], ["updated_at", "2019-05-30 17:08:41.799596"], ["id", 4]]
UPDATE "teachers" SET "photo" = $1, "updated_at" = $2 WHERE "teachers"."id" = $3  [["photo", "/uploads/t1.jpg"], ["updated_at", "2019-05-30 18:32:33.173212"], ["id", 2]]