app/controllers/admin_schedule_controller.rb

SELECT COUNT(*) FROM "schedules" WHERE "schedules"."group" = $1 AND "schedules"."lesson" = $2 AND "schedules"."day" = $3  [["group", "11-А"], ["lesson", 1], ["day", 2]]
INSERT INTO "schedules" ("group", "day", "classroom", "created_at", "updated_at", "teacher_id", "lesson") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["group", "11-А"], ["day", 2], ["classroom", "78"], ["created_at", "2019-05-28 14:34:33.716069"], ["updated_at", "2019-05-28 14:34:33.716069"], ["teacher_id", 2], ["lesson", 1]]
---
	def create
		@schedule = Schedule.new(schedule_params)

		if Schedule.where(group: @schedule.group, lesson: @schedule.lesson, day: @schedule.day).count != 0
			flash[:danger] = "This group already has lesson in this time"
			render 'new'
			return
		end

		if @schedule.save

DELETE FROM "schedules" WHERE "schedules"."id" = $1  [["id", 3]]
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def destroy
		Schedule.find(params[:id]).destroy

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
	def edit
		@schedule = Schedule.find(params[:id])

SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT COUNT(*) FROM "schedules" WHERE "schedules"."group" = $1 AND "schedules"."lesson" = $2 AND "schedules"."day" = $3  [["group", "11-А"], ["lesson", nil], ["day", 1]]
UPDATE "schedules" SET "group" = $1, "updated_at" = $2 WHERE "schedules"."id" = $3  [["group", "11-А"], ["updated_at", "2019-05-28 14:35:56.970982"], ["id", 8]]
---
	def save
		@schedule = Schedule.find(params[:id])
		if Schedule.where(group: params[:schedule][:group],
						  lesson: params[:schedule][:lesson],
						  day: params[:schedule][:day]).count != 0
			flash[:danger] = "This group already has lesson in this time"
			render 'edit'
			return
		end

		@schedule = Schedule.update(params[:id], schedule_params)