app/controllers/application_controller.rb

	def index
		@news = Micropost.order(:id).limit(10).reverse_order
---
SELECT  "microposts".* FROM "microposts" ORDER BY "microposts"."id" DESC LIMIT $1  [["LIMIT", 10]]

	def teachers
		@teachers = Teacher.all
---
SELECT "teachers".* FROM "teachers"

	def schedule
		@groups = Schedule.select(:group).map(&:group).uniq
---
SELECT "schedules"."group" FROM "schedules"

	def filledschedule
		@groups = Schedule.select(:group).map(&:group).uniq
		@lessons = Schedule.where(group: params[:group])
---
SELECT "schedules"."group" FROM "schedules"
SELECT "schedules".* FROM "schedules" WHERE "schedules"."group" = $1  [["group", "uih"]]