app/controllers/news_controller.rb

  def view
    @post = Micropost.find(params[:id])
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]