app/controllers/users_controller.rb

  def create
	@user = User.new(user_params)

	if params[:user][:master_password] != MASTER_PASSWORD
		flash[:danger] = "Master password doesnt match"
		render 'new'
		return
	end

	if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def view
	@user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]