app/views/admin_schedule/edit.html.erb

SELECT "teachers".* FROM "teachers"
---
			<br>
			<%= f.select :teacher_id, options_for_select(Teacher.all.map{|t|[t.name, t.id]}) %>