app/views/admin_schedule/new.html.erb

			<br>
			<%= f.select :teacher_id, options_for_select(Teacher.all.map{|t|[t.name, t.id]}) %>
---
SELECT "teachers".* FROM "teachers"